КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/КонтурЛогистика_ПунктыМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПунктыМаршрута</name>
  <attributes>
    <name>GLN</name>
    <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИндекс</name>
    <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКодРегион</name>
    <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфАдрес</name>
    <comment>(вариант 1) Текстовое представление адреса - обязательно при указании адреса простым текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфКодСтраны</name>
    <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресГород</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаселПункт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресУлица</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРайон</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДом</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКорпус</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКварт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Нормализованное текстовое представление адреса по ГАР/ФИАС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГАР</name>
    <comment>может быть указан вместо всех других адресных полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГАРЗначение</name>
    <comment>JSON структуры адреса ФИАС/ГАР для исходящего XDTO</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресу</name>
    <comment>необязательный, передается в сообщении для всех способов задания адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наш</name>
    <comment>если да, то становятся доступными расширенные настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправление</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прибытие</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <comment>обязателен для пунктов отгрузки. ОрганизацияДиадок, являющаяся собственником пункта маршрута. Или укажите причину почему нет данных в реквизите СобственникНеУказанПричина</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственникНеУказанПричина</name>
    <comment>текстовое описание причины по которой для точки отгрузки нет сведений о её собственнике</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуДоговор</name>
    <comment>ОснДостОбИнфрДок - на основании чего пользуемся складом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуТекст</name>
    <comment>ОснДостОбИнфрТекст  - Основание беспрепятственного доступа к объекту инфраструктуры пункта погрузки лица, осуществляющего погрузку груза в транспортное средство: текст при отсутствии подтверждающих документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ПунктМаршрутаУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТелефоныПереадресующегоПоУмолчанию</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателейУведомлений</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтВодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтПеревозчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НаправлениеКонвертации/КонтурЛогистика_НаправлениеКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НаправлениеКонвертации</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>ИсходящееВходящее</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдетВыборАдресаИзСписка;

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("УказатьСобственника", УказатьСобственника);
	
	// +++ КонтурЛогистика_НастройкиКонвертацииСправочников
	
	КонтурЛогистика_КонвертацияСервер.НастройкиКонвертацииСправочников_ПриСозданииНаСервере(
		ЭтаФорма, "КонтурЛогистика_ПунктыМаршрута", ЭтаФорма, Элементы.Группа11);
		
	// --- КонтурЛогистика_НастройкиКонвертацииСправочников
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// Определяем использованность каналов отправки
	Элементы.ГруппаИспользоватьОтправкуВТелеграм.Видимость =
		Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
	Элементы.ГруппаИспользоватьОтправкуНаПочту.Видимость =
		Не КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
	ЗаполнитьСписокВыбораЧасовыхПоясов();
	
	Если Параметры.Свойство("ТекущаяСтраница") Тогда 
		Если Элементы.Найти(Параметры.ТекущаяСтраница) <> Неопределено Тогда
			Элементы.АдресСтраницы.ТекущаяСтраница = Элементы[Параметры.ТекущаяСтраница];
		Иначе
			Элементы.АдресСтраницы.ТекущаяСтраница = Элементы.СтраницаАдрес;
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьАдресНаФорме();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
	Если УказатьСобственника Тогда
		УказатьСобственникаПунктаМаршрута();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("КонтурЛогистика_ПерепроверитьДокумент");
	Оповестить("КонтурЛогистика_ПунктМаршрута", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлениеПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.Собственник.АвтоОтметкаНезаполненного = Объект.Отправление;
	Элементы.Собственник.ОтметкаНезаполненного = Объект.Отправление;

	Элементы.СобственникНеУказанПричина.Видимость 	= Не ЗначениеЗаполнено(Объект.Собственник);
	Элементы.ДоступКОбъектуТекст.Видимость 			= Не ЗначениеЗаполнено(Объект.ДоступКОбъектуДоговор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура СобственникПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДоступКОбъектуДоговорПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ВыбратьРегионНаСервере()
	ДанныеМакета = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТаблицуРегионовРФ();
	Элементы.АдресКодРегион.СписокВыбора.Очистить();
	Для Каждого текСтрока Из ДанныеМакета Цикл 
		Элементы.АдресКодРегион.СписокВыбора.Добавить(текСтрока.Код, текСтрока.Наименование + " " + текСтрока.Код);
	КонецЦикла;
	Элементы.АдресКодРегион.РежимВыбораИзСписка = Истина;
	Элементы.АдресКодРегион.КнопкаВыпадающегоСписка = Истина;
	Элементы.ВыбратьРегион.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРегион(Команда)
	ВыбратьРегионНаСервере();
КонецПроцедуры

// +++ КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СоздатьНастройкуКонвертации(Элемент) Экспорт
	
	КонтурЛогистика_КонвертацияКлиент.СоздатьНастройкуКонвертации(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНастройкеКонвертацииСправочника(Элемент) Экспорт 
	
	КонтурЛогистика_КонвертацияКлиент.ПерейтиКНастройкеКонвертацииСправочника(ЭтаФорма);	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
  КонтурЛогистика_КонвертацияКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

// --- КонтурЛогистика_НастройкиКонвертацииСправочников

&НаКлиенте
Процедура СвязанныеОбъектыПослеУдаления(Элемент)
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ПоискИндекса(Команда)
	КонтурЛогистика_ИнтеграцияДиадокКлиент.ПерейтиПоСсылке("https://www.pochta.ru/indexes");
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПолучателейУведомленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контекст", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ТипКонтакта", ТекущиеДанные.Тип);
	ПараметрыОткрытия.Вставить("ЗначениеКонтакта", ТекущиеДанные.Контакт);
	ПараметрыОткрытия.Вставить("ТрНЗамечанияОтВодителя", ТекущиеДанные.ТрНЗамечанияОтВодителя);
	ПараметрыОткрытия.Вставить("ТрНЗамечанияОтПеревозчика", ТекущиеДанные.ТрНЗамечанияОтПеревозчика);
	ПараметрыОткрытия.Вставить("ТрНОтказПВ", ТекущиеДанные.ТрНОтказПВ);
	ПараметрыОткрытия.Вставить("ТрНОтказГП", ТекущиеДанные.ТрНОтказГП);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаВыбораКонтакта";
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ИзменениеКонтактнойИнформацииЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКонтактыПолучателейУведомлений(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Контекст", Объект.Ссылка);
	
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_ПунктыМаршрута.Форма.ФормаВыбораКонтакта";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыОткрытия, ЭтаФорма, ЭтаФорма,
		"ДобавлениеКонтактнойИнформацииЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Объект.КонтактыПолучателейУведомлений.Добавить();
	НоваяСтрока.Тип = Результат.ТипКонтакта;
	НоваяСтрока.Контакт = Результат.ЗначениеКонтакта;
	НоваяСтрока.ТрНЗамечанияОтВодителя = Результат.ТрНЗамечанияОтВодителя;
	НоваяСтрока.ТрНЗамечанияОтПеревозчика = Результат.ТрНЗамечанияОтПеревозчика;
	НоваяСтрока.ТрНОтказПВ = Результат.ТрНОтказПВ;
	НоваяСтрока.ТрНОтказГП = Результат.ТрНОтказГП;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКонтактнойИнформацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.Тип = Результат.ТипКонтакта;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.Контакт = Результат.ЗначениеКонтакта;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНЗамечанияОтВодителя = Результат.ТрНЗамечанияОтВодителя;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНЗамечанияОтПеревозчика = Результат.ТрНЗамечанияОтПеревозчика;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНОтказПВ = Результат.ТрНОтказПВ;
	Элементы.КонтактыПолучателейУведомлений.ТекущиеДанные.ТрНОтказГП = Результат.ТрНОтказГП;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактыПолучателейУведомленийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭлементУчетнойСистемы(Команда)
	
	Если ЭтаФорма.СписокНастроекКонвертации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыборЭлементаУчетнойСистемыДляЗаполнения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения");
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ВыбратьЭлементУчетнойСистемыЗавершение(ВыбранноеЗначение, ДополнительныеПараметры);
	
	УправлениеВидимостьюЭлементовФормыПослеКонвертации();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюЭлементовФормыПослеКонвертации() Экспорт
	
	УстановитьВидимостьЭлементов();
	
	УправлениеВидимостьюЭлементовФормыСервер();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюЭлементовФормыСервер()
	
	КонтурЛогистика_КонвертацияСервер.УправлениеВидимостьюЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПоказатьСписокТиповДляСвязанногоОбъекта(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыСвязанныйОбъектОткрытие(Элемент, СтандартнаяОбработка)	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОткрытьСвязанныйОбъект(ЭтаФорма, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеОбъектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработкаВыбораСвязанногоОбъекта(ЭтаФорма, ВыбранноеЗначение);
	ОбновитьПовторноИспользуемыеЗначения();
				
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Перед добавлением необходимо сохранить");
		Возврат;
	КонецЕсли;
			
	ИмяФормыСправочника = "Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаВыбора";
	НаправлениеКонвертации = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее");
	ИмяТипаСправочника = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоСсылкеНаДокумент(Объект.Ссылка);
	
	ЗначениеОтбора = Новый Структура("НаправлениеКонвертации, ТипСправочникаЛогистика", НаправлениеКонвертации, ИмяТипаСправочника); 
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		ИмяФормыСправочника, ПараметрыФормы, ЭтаФорма, ЭтаФорма,
		"СоздатьНаОснованииНачалоВыбораЗавершение", Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьНаОснованииНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Сообщить("Не выбрана настройка конвертации справочника");
		Возврат;
	КонецЕсли;
	
	НастройкаКонвертацииСправочника = Результат;
	КонтурЛогистика_КонвертацияКлиент.КонвертироватьОбъектСправочникаЛогистикиВОбъектУС(ЭтаФорма, НастройкаКонвертацииСправочника);
	
	Элементы.СинхронизироватьОбъектЛогистикиСОбъектомУС.Видимость = Объект.СвязанныеОбъекты.Количество() = 1;

КонецПроцедуры        

&НаКлиенте
Процедура АдресКодРегионПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.АдресКодРегион) Тогда
		Возврат;
	КонецЕсли;
	
	ЧасовойПоясЛок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЧасовойПоясПоКодуРегиона(Объект.АдресКодРегион);
	
	Если ЗначениеЗаполнено(Объект.ЧасовойПояс)
		И Объект.ЧасовойПояс <> ЧасовойПоясЛок Тогда
		
		ТекстВопроса = "Часовой пояс заполнен и не совпадает с значением по умолчанию. Перезаполнить?";
		ДополнительныеПараметры = Новый Структура("ЧасовойПоясЛок", ЧасовойПоясЛок);
		Оповещение = Новый ОписаниеОповещения("АдресКодРегионПриИзмененииЗавершение", ЭтаФорма, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса,РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	Иначе
		Объект.ЧасовойПояс = ЧасовойПоясЛок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКодРегионПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет
		Или Ответ = КодВозвратаДиалога.Отмена
		Или Ответ = Неопределено Тогда
		
		Возврат;
	КонецЕсли;
	
	Объект.ЧасовойПояс = ДополнительныеПараметры.ЧасовойПоясЛок;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЧасовыхПоясов()
	
	Элементы.ЧасовойПояс.СписокВыбора.Очистить();
	Элементы.ЧасовойПояс.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	
	Для Каждого ТекущаяСтрока Из Элементы.ЧасовойПояс.СписокВыбора Цикл
		ТекущаяСтрока.Представление = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеЧасовогоПоясаЛок(ТекущаяСтрока.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСобственникаПунктаМаршрута()
	
	Элементы.АдресСтраницы.ТекущаяСтраница = Элементы.ДанныеСобственника;
	ТекущийЭлемент = Элементы.Собственник;
	
КонецПроцедуры
#Область ВводАдреса

&НаСервере
Процедура ИнициализироватьАдресНаФорме()
	
	КонтурЛогистика_ВводАдреса.ПодготовитьОтображениеАдресаПунктаМаршрута(Объект);
	АдресСтрокаВвод = КонтурЛогистика_ВводАдреса.ТекстАдресаДляОтображенияПунктаМаршрута(Объект);
	АдресКодГАРВвод = Объект.КодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоАдресРоссииНаСервере(Знач АдресИнфКодСтраны)
	
	Возврат КонтурЛогистика_ВводАдреса.ЭтоСтранаРоссияДляАдреса(АдресИнфКодСтраны);
	
КонецФункции

&НаКлиенте
Процедура АдресИнфКодСтраныПриИзменении(Элемент)
	
	ПриИзмененииСтраныАдресаНаСервере(АдресСтрокаВвод);
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ИдетВыборАдресаИзСписка = Ложь;
	
	Если Не ЭтоАдресРоссииНаСервере(Объект.АдресИнфКодСтраны) Тогда
		Возврат;
	КонецЕсли;
	
	ПодготовитьПодсказкиАдреса(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ИдетВыборАдресаИзСписка = Истина;
	Попытка
		АдресСтрокаВвод = ВыбранноеЗначение.Подсказка;
		Если ВыбранноеЗначение.Свойство("ЭтоСвободнаяФорма")
			И ВыбранноеЗначение.ЭтоСвободнаяФорма Тогда
			АдресКодГАРВвод = "";
			ПрименитьТекстАдресаНаСервере(ВыбранноеЗначение.Подсказка);
		Иначе
			ПрименитьПодсказкуАдресаНаСервере(ВыбранноеЗначение.ИдентификаторФИАС, ВыбранноеЗначение.Подсказка);
		КонецЕсли;
	Исключение
		ИдетВыборАдресаИзСписка = Ложь;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСтрокаПриИзменении(Элемент)
	
	Если ИдетВыборАдресаИзСписка = Истина Тогда
		ИдетВыборАдресаИзСписка = Ложь;
		Возврат;
	КонецЕсли;
	
	АдресКодГАРВвод = "";
	Элементы.ДекорацияТипАдреса.Заголовок = "";
	ПрименитьТекстАдресаНаСервере(АдресСтрокаВвод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПодсказкиАдреса(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	ТекстПоиска = СокрЛП(Текст);
	Если СтрДлина(ТекстПоиска) < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Подсказки = ПодсказкиАдресаНаСервере(ТекстПоиска);
	Если Подсказки = Неопределено Тогда
		ДобавитьВыборСвободнойФормыАдреса(ДанныеВыбора, ТекстПоиска);
		Возврат;
	КонецЕсли;
	
	Для Каждого Подсказка Из Подсказки Цикл
		
		Если Подсказка.Свойство("ЭтоСвободнаяФорма")
			И Подсказка.ЭтоСвободнаяФорма Тогда
			ДанныеВыбора.Добавить(Подсказка, Подсказка.ПредставлениеВыбора);
			Продолжить;
		КонецЕсли;
		
		Представление = Подсказка.Подсказка;
		Если Не ЗначениеЗаполнено(Представление) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Подсказка, Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыборСвободнойФормыАдреса(ДанныеВыбора, Знач ТекстПоиска)
	
	ВыборСвободнойФормы = Новый Структура;
	ВыборСвободнойФормы.Вставить("Подсказка", ТекстПоиска);
	ВыборСвободнойФормы.Вставить("ИдентификаторФИАС", "");
	ВыборСвободнойФормы.Вставить("УровеньФИАС", "");
	ВыборСвободнойФормы.Вставить("ЭтоСвободнаяФорма", Истина);
	ДанныеВыбора.Добавить(ВыборСвободнойФормы, "<добавить в свободной форме>");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСтраныАдресаНаСервере(Знач ТекстАдреса)
	
	АдресКодГАРВвод = "";
	СброситьКодГАРАдресаНаСервере();
	
	Если Не КонтурЛогистика_ВводАдреса.ЭтоСтранаРоссияДляАдреса(Объект.АдресИнфКодСтраны) Тогда
		КонтурЛогистика_ВводАдреса.ПрименитьИностранныйАдресПунктаМаршрута(Объект, ТекстАдреса);
		АдресСтрокаВвод = Объект.АдресИнфАдрес;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьКодГАРАдресаНаСервере()
	
	Объект.КодГАР = "";
	Объект.АдресГАРЗначение = "";
	КонтурЛогистика_ВводАдреса.ОчиститьАдресКЛАДРПунктаМаршрута(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьТекстАдресаНаСервере(Знач ТекстАдреса)
	
	Если ЗначениеЗаполнено(АдресКодГАРВвод) Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ВводАдреса.ПрименитьРучнойТекстАдресаПунктаМаршрута(Объект, ТекстАдреса);
	АдресСтрокаВвод = Объект.АдресИнфАдрес;
	АдресКодГАРВвод = Объект.КодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьПодсказкуАдресаНаСервере(Знач ИдентификаторФИАС, Знач Представление)
	
	КонтурЛогистика_ВводАдреса.ПрименитьАдресИзПодсказкиФИАСКПунктуМаршрута(
		Объект, ИдентификаторФИАС, Представление);
	АдресСтрокаВвод = Объект.АдресИнфАдрес;
	АдресКодГАРВвод = Объект.КодГАР;
	ОбновитьИнформативнуюНадписьАдреса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодсказкиАдресаНаСервере(Знач Текст)
	
	Попытка
		Клиент = КонтурЛогистика_ВводАдреса.НовыйФиасКлиент("", КонтурЛогистика_ВводАдреса.ЛокацияФиасПоУмолчанию());
		Возврат КонтурЛогистика_ВводАдреса.ПодсказкиАдреса(Клиент, Текст);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформативнуюНадписьАдреса()
	
	ТипАдреса = КонтурЛогистика_ВводАдреса.ОпределитьТипАдресаПунктаМаршрута(Объект);
	Элементы.ДекорацияТипАдреса.Заголовок =
		КонтурЛогистика_ВводАдреса.ЗаголовокИнформацииТипаАдресаПунктаМаршрута(ТипАдреса);
	
КонецПроцедуры

#КонецОбласти
